---
title: Stone
classe: Autodesk.Revit.DB.Visual.Stone
namespace: Autodesk.Revit.DB.Visual
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 10
---

# Stone

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `String CommonTintColor { get; }` | `Stone.CommonTintColor` | String |
| `String CommonTintToggle { get; }` | `Stone.CommonTintToggle` | String |
| `String StoneApplication { get; }` | `Stone.StoneApplication` | String |
| `String StoneBump { get; }` | `Stone.StoneBump` | String |
| `String StoneBumpAmount { get; }` | `Stone.StoneBumpAmount` | String |
| `String StoneBumpMap { get; }` | `Stone.StoneBumpMap` | String |
| `String StoneColor { get; }` | `Stone.StoneColor` | String |
| `String StonePattern { get; }` | `Stone.StonePattern` | String |
| `String StonePatternAmount { get; }` | `Stone.StonePatternAmount` | String |
| `String StonePatternMap { get; }` | `Stone.StonePatternMap` | String |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```